Repository: aaw-team/pagenotfoundhandling
Catalog: Resources/Private/Language/*.backend.xlf
Languages: de

# constants.logLevel
source: Log level:The log with the according entries is written to a file in the TYPO3 log dir. Caution: logLevel DEBUG will log request parameters like session-cookies and/or HTTP Authorization, do not use in production environments! Default: '3'.
de: Log level:Eine Log-Datei mit den entsprechenden Einträgen wird TYPO3 Log-Verzeichnis geschrieben. Vorsicht: bei logLevel DEBUG werden parameter wie session-cookies und/oder HTTP Authorization aufgezeichet, nicht in produktiven Umgebungen verwenden! Standard: '3'.

# site.disableStatisticsRecording
source: Disable statistics
de: Statistik deaktivieren

# site.additionalGetParams
source: Additional GET parameters
de: Zusätzliche GET Parameter

# site.passthroughContentTypeHeader
source: Passthrough Content-Type HTTP header
de: Content-Type HTTP Header durchreichen

# site.requestTimeout
source: Request timeout
de: Anfrage-Zeitüberschreitung

# site.requestTimeout.description
source: Supersedes TYPO3_CONF_VARS[HTTP][timeout]
de: Überschreibt TYPO3_CONF_VARS[HTTP][timeout]

# site.connectTimeout
source: Request connection timeout (supersedes TYPO3_CONF_VARS[HTTP][connect_timeout])
de: Verbindung-Zeitüberschreitung

# site.connectTimeout.description
source: Supersedes TYPO3_CONF_VARS[HTTP][connect_timeout]
de: Überschreibt TYPO3_CONF_VARS[HTTP][connect_timeout]

# site.forceLanguage
source: Force language
de: Sprache erzwingen

# site.forceLanguage.description
source: When disabled, the requested language will be used (if possible)
de: Wenn deaktiviert, wird die angefragte Sprache verwendet (falls möglich)

# site.forceLanguage.disable
source: Disable (use requested language if possible)
de: Deaktivieren

# site.trustInsecureIncomingConnections
source: Trust data from insecure incoming connections
de: Eingehenden unsicheren Verbindungen vertrauen

# site.trustInsecureIncomingConnections.description
source: This allows using cookies and/or authentication data to be passed to the error page request, when the initial request is not via https://
de: Damit können Cookie- und/oder Authentifizierungs-Daten in der Anfrage an die Fehler-Seite verwendet werden, wenn die initiale Anfrage nicht via https:// ist

# site.passAuthinfoToInsecureConnections
source: Pass authentication information to insecure connections
de: Autentifizierungs-Daten an unsichere Verbindungen weitergeben

# site.passAuthinfoToInsecureConnections.description
source: This allows using cookies and/or authentication data to be sent to the error page request via http://
de: Damit können Cookie- und/oder Authentifizierungs-Daten via http:// an die Fehler-Seite gesendet werden

# site.disableCertificateVerification
source: Disable certificate verification. Attention: this is dangerous, do not enable in production environments!
de: Zertifikats-Verifizierung deaktivieren. Vorsicht: dies ist gefährlich, nicht in produktiven Umgebungen verwenden!

# site.disableCertificateVerification
source: Dangerous: disable certificate verification
de: Gefährlich: Zertifikats-Verifizierung deaktivieren

# site.disableCertificateVerification.description
source: NEVER EVER do this in production environments!
de: NIEMALS in produktiven Umgebungen einschalten!

# site.debugErrorPageRequestException
source: Render a debug message when an error occurs
de: Debug Nachricht bei Fehler anzeigen

# site.debugErrorPageRequestException.description
source: Make errors more transparent, when fetching the error page fails. Caution: this is a development option, do not enable in production environments!
de: Macht Fehlermeldungen transparent, wenn das Holen der Fehler-Seite fehlschlägt. Vorsicht: dies ist eine Entwickler-Option, nicht in produktiven Umgebungen verwenden!

# site.tabs.pnfh
source: Error Handling (advanced)
de: Error Handling (erweitert)

# site.palettes.pnfh-basic
source: Basic
de: Basis

# site.palettes.pnfh-fetching
source: Fetching the Error Page (request options)
de: Fehler-Seite holen (request options)

# site.palettes.pnfh-responding
source: Delivering the Error Page (response options)
de: Fehler-Seite ausliefern (response options)

# site.palettes.pnfh-language
source: Language
de: Sprache

# site_errorhandling.errorPage
source: Error Page
de: Fehler-Seite

# site_errorhandling.additionalGetParams
source: Additional GET parameters
de: Zusätzliche GET Parameter

# site_errorhandling.palettes.pnfh-advanced
source: Advanced
de: Erweitert
